In [1]:
import pandas as pd
import numpy as np

import warnings
warnings.filterwarnings('ignore')

In [2]:
BASE_PATH = '/home/marco/ifood-case'
DATA_RAW_PATH = BASE_PATH + '/data/raw/'

# profile.json

In [3]:
df_profile = pd.read_json(DATA_RAW_PATH + 'profile.json')
df_profile

,age,registered_on,gender,id,credit_card_limit
0,118,20170212,None,68be06ca386d4c31939f3a4f0e3dd783,NaN
1,55,20170715,F,0610b486422d4921ae7d2bf64640c50b,112000.0
2,118,20180712,None,38fe809add3b4fcf9315a9694bb96ff5,NaN
3,75,20170509,F,78afa995795e4d85b5d9ceeca43f5fef,100000.0
4,118,20170804,None,a03223e636434f42ac4c3df47e8bac43,NaN
...,...,...,...,...,...
16995,45,20180604,F,6d5f3a774f3d4714ab0c092238f3a1d7,54000.0
16996,61,20180713,M,2cb4f97358b841b9a9773a7aa05a9d77,72000.0
16997,49,20170126,M,01d26f638c274aa0b965d24cefe3183f,73000.0
16998,83,20160307,F,9dc1421481194dcd9400aec7c9ae6366,50000.0
16999,62,20170722,F,e4052622e5ba45a8b96b59aba68cf068,82000.0

## age

In [4]:
df_profile['age'].describe()

count    17000.000000
mean        62.531412
std         26.738580
min         18.000000
25%         45.000000
50%         58.000000
75%         73.000000
max        118.000000
Name: age, dtype: float64

In [5]:
df_profile_100 = df_profile[df_profile['age'] > 100]
df_profile_100

,age,registered_on,gender,id,credit_card_limit
0,118,20170212,None,68be06ca386d4c31939f3a4f0e3dd783,NaN
2,118,20180712,None,38fe809add3b4fcf9315a9694bb96ff5,NaN
4,118,20170804,None,a03223e636434f42ac4c3df47e8bac43,NaN
6,118,20170925,None,8ec6ce2a7e7949b1bf142def7d0e0586,NaN
7,118,20171002,None,68617ca6246f4fbc85e91a2a49552598,NaN
...,...,...,...,...,...
16980,118,20160901,None,5c686d09ca4d475a8f750f2ba07e0440,NaN
16982,118,20160415,None,d9ca82f550ac4ee58b6299cf1e5c824a,NaN
16989,118,20180305,None,ca45ee1883624304bac1e4c8a114f045,NaN
16991,118,20160116,None,a9a20fa8b5504360beb4e7c8712f8306,NaN
16994,118,20151211,None,c02b10e8752c4d8e9b73f918558531f7,NaN

In [6]:
df_profile_100.dropna()

,age,registered_on,gender,id,credit_card_limit
1556,101,20171004,F,4d2ccfcbbebf4bd9baf4b7e433d0e288,43000.0
4100,101,20150526,F,d2fdc2be8ab64e4ba04830d441e53fd5,99000.0
14846,101,20171109,F,e0ea90ddd2f147e082d21e97f51ec1b1,56000.0
15800,101,20170309,F,047ad0135cfe4c0ea5ba019da4de9c52,59000.0
16864,101,20171127,F,1593d617fac246ef8e50dbb0ffd77f5f,82000.0

In [7]:
df_profile_100['gender'].value_counts()

gender
F    5
Name: count, dtype: int64

In [8]:
df_profile_100['credit_card_limit'].describe()

count        5.000000
mean     67800.000000
std      22398.660674
min      43000.000000
25%      56000.000000
50%      59000.000000
75%      82000.000000
max      99000.000000
Name: credit_card_limit, dtype: float64

In [9]:
df_profile = df_profile[df_profile['age'] <= 101]

In [10]:
df_profile.groupby("gender")["age"].describe()

         count       mean        std   min   25%   50%   75%    max
gender
F       6129.0  57.544950  16.883315  18.0  48.0  58.0  69.0  101.0
M       8484.0  52.116690  17.413894  18.0  39.0  53.0  65.0  100.0
O        212.0  54.400943  16.244710  20.0  43.0  55.0  66.0  100.0

## registered_on

In [11]:
df_profile['registered_on'] = pd.to_datetime(df_profile['registered_on'], format='%Y%m%d')
df_profile = df_profile.sort_values('registered_on')

In [12]:
df_profile['registered_on'].describe()

count                            14825
mean     2017-02-18 12:30:15.419898880
min                2013-07-29 00:00:00
25%                2016-05-20 00:00:00
50%                2017-08-02 00:00:00
75%                2017-12-30 00:00:00
max                2018-07-26 00:00:00
Name: registered_on, dtype: object

## gender

In [13]:
df_profile['gender'].value_counts()

gender
M    8484
F    6129
O     212
Name: count, dtype: int64

## id

In [14]:
df_profile['id'] = df_profile['id'].str.strip()

In [15]:
df_profile[df_profile['id'].isnull()]

Empty DataFrame
Columns: [age, registered_on, gender, id, credit_card_limit]
Index: []

In [16]:
df_profile[df_profile['id'] == '']

Empty DataFrame
Columns: [age, registered_on, gender, id, credit_card_limit]
Index: []

## credit_card_limit

In [17]:
df_profile['credit_card_limit'].describe()

count     14825.000000
mean      65404.991568
std       21598.299410
min       30000.000000
25%       49000.000000
50%       64000.000000
75%       80000.000000
max      120000.000000
Name: credit_card_limit, dtype: float64

In [18]:
df_profile.groupby("gender")["credit_card_limit"].describe()

,count,mean,std,min,25%,50%,75%,max
gender,,,,,,,,
F,6129.0,71306.412139,22338.353773,30000.0,54000.0,71000.0,88000.0,120000.0
M,8484.0,61194.601603,20069.517615,30000.0,45000.0,59000.0,73000.0,120000.0
O,212.0,63287.735849,18938.594726,30000.0,51000.0,62000.0,79250.0,100000.0